{
  "episodes": [
    {
      "id": "the-importance-of-contribution-in-open-source",
      "title": "DevSpeak #30 | The importance of contribution in Open Source",
      "members": "Diego Fernandes, João Pedro, Diego Haz and Bruno Lemos",
      "published_at": "2021-01-22 16:35:40",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/opensource.jpg",
      "description": "<p>In this episode of Faladev, Diego Fernandes sits down with João Pedro Schmitz, Bruno Lemos and Diego Haz, to discuss the importance of open source contribution and what challenges are circulating in the community.</p><p>We spend most of our time writing code. Now it's time to talk about it. Every week we gather tech professionals to discuss everything that circulates in the programming orbit.</p><p>DevSpeak is an original Rocketseat podcast.</p><p>Audio in BrazilianPortuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/opensource.m4a",
        "type": "audio/x-m4a",
        "duration": 3981
      }
    },
    {
      "id": "a-conversation-on-functional-programming-and-object-orientation",
      "title": "DevSpeak #29 | Two different perspectives at the table: a conversation about FP and OOP",
      "members": "Diego Fernandes, Dani Leão, Laura Beatris and Rafael Camarda",
      "published_at": "2021-01-15 13:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/funcional.jpg",
      "description": "<p>Diego and Dani welcomed Laura Beatris and Rafael Camarda to the DevSpeak table to talk about functional programming and object-oriented programming.</p><p>Market analysis, concepts in practice and challenges in adopting any development method. All this in a dynamic conversation relevant to our audience.</p><p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together technology professionals to discuss everything that circulates in the programming orbit.</p><p>The DevSpeak is an original Rocketseat podcast.</p><p>Audio in Brazilian Portuguese</>\n",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/funcional.m4a",
        "type": "audio/x-m4a",
        "duration": 4237
      }
    },
    {
      "id": "barriers-and-solutions-proposed-micro-services",
      "title": "DevSpeak #28 | Behind barriers and solutions proposed by micro-services",
      "members": "Diego Fernandes, Dani Leão, Wesley Williams and Lucas Santos",
      "published_at": "2021-01-08 13:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/microservicos.jpg",
      "description": "<p>Developers Wesley Willians and Lucas Santos were invited to this Faladev to have a conversation about what are microservices and what are the challenges and barriers to their application.</p><p>In this edition, Diego Fernandes and Daniele Evangelista guide the conversation raising relevant topics and questions about the subject.</p><p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together tech professionals to discuss everything that circulates in the programming orbit.</p><p>The DevSpeak is an original Rocketseat podcast.</p><p>#programming #rocketseat #programmer</p><p>Audio in Brazilian Portuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/microservicos.m4a",
        "type": "audio/x-m4a",
        "duration": 5506
      }
    },
    {
      "id": "applying-mvc-and-clean-architecture-in-practice",
      "title": "DevSpeak #27 | Application of MVC and CA architectures in practice",
      "members": "Diego Fernandes, Dani Leão, Otávio Lemos and Rodrigo Branas",
      "published_at": "2020-12-18 14:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/clean.jpg",
      "description": "<p>Diego Fernandes and Daniele Evangelista hosted Otávio Lemos and Rodrigo Branas to chat about modern development architectures, applied in the tech industry.</p><p>What are the fundamentals, principles and importance of discussing architectures in this ecosystem?</p><p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together tech professionals to discuss everything circulating in the programming orbit.</p><p>DevSpeak is a Rocketseat original podcast.  Factsheet Hosts: Diego Fernandes and Daniele Leão Evangelista Guests: Otávio Lemos and Rodrigo Branas Script: Felipe Buzzi, Beatriz Clasen and Thiago Marinho Editing: Thiago Santana Production: Leonardo Minatti</p><p>Audio in Brazilian Portuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/clean.m4a",
        "type": "audio/x-m4a",
        "duration": 5044
      }
    },
    {
      "id": "interview-jose-valim-elixir-creator",
      "title": "DevSpeak #26 | Especial: exclusive interview with José Valim, creator of the Elixir language",
      "members": "Diego Fernandes and José Valim",
      "published_at": "2020-12-04 15:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/josevalim.jpg",
      "description": "<p>In this special end of season edition we had the opportunity to have a conversation with José Valim, Brazilian dev who created the Elixir programming language - used internationally in several technologies, including Discord and Pinterest. </p><p>The topic of the week revolved around various processes involved in creating a new language, which proposes to be an efficient alternative in the technology market.</p><p>In addition to all this, Valim could talk about a lot of code and about his journey and experience in creating an active community behind open source.</p><p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together three tech professionals to discuss everything that circulates in the programming orbit.</p><p>The DevSpeak is a Rocketseat original podcast where we talk about various topics that matter to your dev career.</p><p>Audio in Portuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/jose-valim.m4a",
        "type": "audio/x-m4a",
        "duration": 4396
      }
    },
    {
      "id": "what-is-ui-ux",
      "title": "DevSpeak #25 | What is UX/UI?",
      "members": "Diego Fernandes, Tiago Luchtenberg and Thainan Librelon",
      "published_at": "2020-10-30 14:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/design.jpg",
      "description": "<p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together three tech professionals to discuss everything that circulates in the programming orbit.</p><p>DevSpeak is an original Rocketseat podcast where we talk about various topics that matter to your dev career.</p><p>In this episode, Diego Fernandes is joined by Thainan Librelon and Tiago Luchtenberg to discuss about: Can developer do UI/UX work, what impact? What is the ideal moment to have people specialized in UX and UI? And after all, what is UI and what is UX? <p>Audio in Brazilian Portuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/design.m4a",
        "type": "audio/x-m4a",
        "duration": 2715
      }
    },
    {
      "id": "how-to-turn-development-leader",
      "title": "DevSpeak #24 | How to become a development leader?",
      "members": "Diego Fernandes, João Paulo and Cleiton Souza",
      "published_at": "2020-10-23 14:00:00",
      "thumbnail": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/lider-desenvolvimento.jpg",
      "description": "<p>We spend most of our time writing code. Now it's time to talk about it. Every week we bring together three tech professionals to discuss everything that goes on in the programming orbit.</p><p>DevSpeak is an original Rocketseat podcast where we talk about a variety of topics that matter to your dev career. In this episode, Diego Fernandes joins Cleiton Souza and João Paulo de Magalhães to discuss leadership, considering professional, technical and even emotional aspects, what does being a dev leader involve? After all, what is a development leader?</p><p>Audio in Brazilian Portuguese.</p>",
      "file": {
        "url": "https://storage.googleapis.com/golden-wind/nextlevelweek/05-podcastr/audios/lider-desenvolvimento.m4a",
        "type": "audio/x-m4a",
        "duration": 2917
      }
    }
  ]
}